// 1.Задача 13: Напишите программу, которая выводит третью цифру заданного числа
// 2.или сообщает, что третьей цифры нет. 
// 3.Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).


// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.WriteLine("Введите Трехзначное число");
int number = Convert.ToInt32(Console.ReadLine());


